In [1]:
import pandas as pd
import numpy as np
import matplotlib.pylab as plt
import sys
reload(sys)
sys.setdefaultencoding('utf8')


data = pd.read_csv("Bank.csv", sep = ';', decimal = '.', header = 0, names = ['age','job','marital', 'education','default','housing','loan','contact','month','day_of_week','duration','campaign','pdays','previous','poutcome','emp_var_rate','cons_price_idx','cons_conf_idx','euribor3m','nr_employed','y'], na_values = 'NaN')

In [2]:
data.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed,y
0,30.0,blue-collar,married,basic.9y,no,yes,no,cellular,may,fri,...,2.0,999,0,nonexistent,-1.8,92.893,-46.2,1.313,5099.1,no
1,39.0,services,single,high.school,no,no,no,telephone,may,fri,...,4.0,999,0,nonexistent,1.1,93.994,-36.4,4.855,5191,no
2,25.0,services,married,high.school,no,yes,no,telephone,jun,wed,...,1.0,999,0,nonexistent,1.4,94.465,-41.8,4.962,5228.1,no
3,38.0,services,married,basic.9y,no,unknown,unknown,telephone,jun,fri,...,3.0,999,0,nonexistent,1.4,94.465,-41.8,4.959,5228.1,no
4,47.0,admin.,married,university.degree,no,yes,no,cellular,nov,mon,...,1.0,999,0,nonexistent,-0.1,93.200,-42.0,4.191,5195.8,no

In [3]:
data.dtypes

age               float64
job                object
marital            object
education          object
default            object
housing            object
loan               object
contact            object
month              object
day_of_week        object
duration          float64
campaign          float64
pdays              object
previous           object
poutcome           object
emp_var_rate       object
cons_price_idx    float64
cons_conf_idx     float64
euribor3m          object
nr_employed        object
y                  object
dtype: object

In [4]:
data.shape

(4119, 21)

In [5]:
data.isnull().sum()

age               3
job               0
marital           0
education         0
default           0
housing           0
loan              0
contact           0
month             0
day_of_week       0
duration          0
campaign          0
pdays             0
previous          0
poutcome          0
emp_var_rate      0
cons_price_idx    4
cons_conf_idx     1
euribor3m         3
nr_employed       4
y                 4
dtype: int64

In [6]:
data_copy = data.copy()

In [7]:
data_copy["age"].value_counts()

32.0     216
31.0     191
30.0     177
34.0     174
35.0     172
33.0     170
36.0     166
38.0     150
41.0     147
29.0     139
37.0     137
39.0     133
42.0     112
28.0     108
43.0     107
47.0     107
45.0     104
40.0     102
46.0      99
44.0      97
54.0      88
27.0      87
48.0      86
49.0      85
50.0      84
53.0      78
51.0      77
52.0      77
56.0      75
55.0      68
        ...
21.0       7
61.0       7
66.0       6
71.0       5
62.0       5
64.0       5
67.0       4
68.0       4
80.0       4
76.0       4
63.0       4
20.0       4
78.0       3
18.0       3
81.0       3
74.0       3
73.0       3
65.0       3
82.0       2
70.0       2
75.0       2
86.0       2
69.0       2
72.0       2
77.0       2
88.0       1
143.0      1
85.0       1
19.0       1
250.0      1
Name: age, Length: 69, dtype: int64

In [8]:
data_copy[['age']][data_copy['age'] == 143]
data_copy[['age']][data_copy['age'] == 250]

       age
394  250.0

In [9]:
data_copy["age"].mean()
data_copy.loc[data_copy.age == 143,'age'] = np.nan
data_copy.loc[data_copy.age == 250,'age'] = np.nan

In [10]:
data_copy["job"].value_counts()

admin.           1012
blue-collar       884
technician        691
services          393
management        324
retired           166
self-employed     159
entrepreneur      148
unemployed        111
housemaid         110
student            82
unknown            39
Name: job, dtype: int64

In [11]:
data_copy[['marital']][data_copy['marital'] == 'divorceded”;”basic.9y']

                   marital
650  divorceded”;”basic.9y

In [12]:
data_copy["marital"].value_counts()

married                  2509
single                   1153
divorced                  445
unknown                    11
divorceded”;”basic.9y       1
Name: marital, dtype: int64

In [13]:
data_copy.loc[data_copy.marital == 'divorceded”;”basic.9y','marital'] = np.nan

In [14]:
data_copy[['education']][data_copy['education'] == 'no']

    education
650        no

In [15]:
data_copy[['education']][data_copy['education'] == 'basic.6yes”;”no']

           education
574  basic.6yes”;”no

In [16]:
data_copy["education"].value_counts()

university.degree      1264
high.school             921
basic.9y                573
professional.course     535
basic.4y                429
basic.6y                227
unknown                 167
no                        1
illiterate                1
basic.6yes”;”no           1
Name: education, dtype: int64

In [17]:
data_copy.loc[data_copy.education == 'basic.6yes”;”no','education'] = np.nan
data_copy.loc[data_copy.education == 'no','education'] = 'unknown'

In [18]:
data_copy["default"].value_counts()

no            3312
unknown        803
yes              2
yess”;”yes       1
noo”;”yes        1
Name: default, dtype: int64

In [19]:
data_copy[['default']][data_copy['default'] == 'yess”;”yes']

        default
574  yess”;”yes

In [20]:
data_copy[['default']][data_copy['default'] == 'noo”;”yes']

       default
569  noo”;”yes

In [21]:
data_copy.loc[data_copy.default == 'yess”;”yes','default'] = 'yes'
data_copy.loc[data_copy.default == 'noo”;”yes','default'] = np.nan

In [22]:
data_copy["housing"].value_counts()

yes         2173
no          1840
unknown      105
cellular       1
Name: housing, dtype: int64

In [23]:
data_copy[['housing']][data_copy['housing'] == 'cellular']

      housing
574  cellular

In [24]:
data_copy.loc[data_copy.housing == 'cellular','housing'] = np.nan

In [25]:
data_copy["loan"].value_counts()

no          3348
yes          663
unknown      105
cellular       2
jul            1
Name: loan, dtype: int64

In [26]:
data_copy[['loan']][data_copy['loan'] == 'cellular']

         loan
569  cellular
650  cellular

In [27]:
data_copy[['loan']][data_copy['loan'] == 'jul']

    loan
574  jul

In [28]:
data_copy.loc[data_copy.loan == 'cellular','loan'] = np.nan
data_copy.loc[data_copy.loan == 'jul','loan'] = np.nan

In [29]:
data_copy["contact"].value_counts()

cellular     2649
telephone    1467
may             1
mon             1
aug             1
Name: contact, dtype: int64

In [30]:
data_copy[['contact']][data_copy['contact'] == 'may']

    contact
650     may

In [31]:
data_copy[['contact']][data_copy['contact'] == 'mon']

    contact
574     mon

In [32]:
data_copy[['contact']][data_copy['contact'] == 'aug']

    contact
569     aug

In [33]:
data_copy.loc[data_copy.contact == 'may','contact'] = np.nan
data_copy.loc[data_copy.contact == 'mon','contact'] = np.nan
data_copy.loc[data_copy.contact == 'aug','contact'] = np.nan

In [34]:
data_copy["month"].value_counts()

may    1377
jul     710
aug     635
jun     530
nov     446
apr     215
oct      69
sep      64
mar      48
dec      22
thu       1
tue       1
298       1
Name: month, dtype: int64

In [35]:
data_copy[['month']][data_copy['month'] == 'thu']

    month
650   thu

In [36]:
data_copy[['month']][data_copy['month'] == 'tue']

    month
569   tue

In [37]:
data_copy[['month']][data_copy['month'] == '298']

    month
574   298

In [38]:
data_copy.loc[data_copy.month == 'thu','month'] = np.nan
data_copy.loc[data_copy.month == 'tue','month'] = np.nan
data_copy.loc[data_copy.month == '298','month'] = np.nan

In [39]:
data_copy["day_of_week"].value_counts()

thu                            858
mon                            854
tue                            840
wed                            795
fri                            768
102                              1
3                                1
275                              1
thu”;-;1;999;0;nonexistent"      1
Name: day_of_week, dtype: int64

In [40]:
data_copy[['day_of_week']][data_copy['day_of_week'] == '102']

    day_of_week
650         102

In [41]:
data_copy[['day_of_week']][data_copy['day_of_week'] == '3']

    day_of_week
574           3

In [42]:
data_copy[['day_of_week']][data_copy['day_of_week'] == '275']

    day_of_week
569         275

In [43]:
data_copy[['day_of_week']][data_copy['day_of_week'] == 'thu”;-;1;999;0;nonexistent"']

                     day_of_week
678  thu”;-;1;999;0;nonexistent"

In [44]:
data_copy.loc[data_copy.day_of_week == '102','day_of_week'] = np.nan
data_copy.loc[data_copy.day_of_week == '3','day_of_week'] = np.nan
data_copy.loc[data_copy.day_of_week == '275','day_of_week'] = np.nan
data_copy.loc[data_copy.day_of_week == 'thu”;-;1;999;0;nonexistent"','day_of_week'] = 'thu'

In [45]:
data_copy["duration"].value_counts()

77.0      24
112.0     23
73.0      22
81.0      21
122.0     20
145.0     20
113.0     20
90.0      20
83.0      20
88.0      19
131.0     19
114.0     19
135.0     19
87.0      18
159.0     18
107.0     18
155.0     18
103.0     18
130.0     17
147.0     17
111.0     17
139.0     17
160.0     17
161.0     17
204.0     17
69.0      17
180.0     17
95.0      17
181.0     16
136.0     16
          ..
522.0      1
726.0      1
687.0      1
857.0      1
992.0      1
1311.0     1
823.0      1
1009.0     1
1806.0     1
757.0      1
1207.0     1
1300.0     1
892.0      1
646.0      1
716.0      1
1720.0     1
1128.0     1
1186.0     1
449.0      1
1190.0     1
611.0      1
825.0      1
898.0      1
638.0      1
373.0      1
457.0      1
1365.0     1
637.0      1
1590.0     1
371.0      1
Name: duration, Length: 830, dtype: int64

In [46]:
data_copy["campaign"].value_counts()

1.000      1762
2.000      1039
3.000       548
4.000       291
5.000       142
6.000        98
7.000        60
8.000        36
9.000        32
10.000       20
11.000       19
12.000       16
17.000       14
13.000       11
16.000        7
14.000        6
29.000        2
23.000        2
19.000        2
22.000        2
15.000        2
999.000       2
18.000        1
93.994        1
27.000        1
24.000        1
35.000        1
0.000         1
Name: campaign, dtype: int64

In [47]:
data_copy[['campaign']][data_copy['campaign'] == 999.000]

     campaign
569     999.0
650     999.0

In [48]:
data_copy[['campaign']][data_copy['campaign'] == 93.994]

     campaign
678    93.994

In [49]:
data_copy.loc[data_copy.campaign == 999.000,'campaign'] = np.nan
data_copy.loc[data_copy.campaign == 93.994,'campaign'] = np.nan

In [50]:
data_copy["pdays"].value_counts()

999            3955
3                52
6                42
4                14
7                10
10                8
12                5
5                 4
0                 4
2                 4
9                 3
1                 3
13                2
15                2
16                2
18                2
11                1
14                1
nonexistent       1
17                1
-36.4             1
19                1
21                1
Name: pdays, dtype: int64

In [51]:
data_copy[['pdays']][data_copy['pdays'] == 'nonexistent']

           pdays
574  nonexistent

In [52]:
data_copy[['pdays']][data_copy['pdays'] == '-36.4']

     pdays
678  -36.4

In [53]:
data_copy.loc[data_copy.pdays == 'nonexistent','pdays'] = np.nan
data_copy.loc[data_copy.pdays == '-36.4','pdays'] = np.nan

In [54]:
data_copy["previous"].value_counts()

0              3519
1               475
2                78
3                25
4                14
5                 2
6                 2
nonexistent       2
4.855             1
1.4               1
Name: previous, dtype: int64

In [55]:
data_copy[['previous']][data_copy['previous'] == 'nonexistent']

        previous
569  nonexistent
650  nonexistent

In [56]:
data_copy[['previous']][data_copy['previous'] == '4.855']

    previous
678    4.855

In [57]:
data_copy[['previous']][data_copy['previous'] == '1.4']

    previous
574      1.4

In [58]:
data_copy.loc[data_copy.previous == 'nonexistent','previous'] = np.nan
data_copy.loc[data_copy.previous == '4.855','previous'] = np.nan
data_copy.loc[data_copy.previous == '1.4','previous'] = np.nan

In [59]:
data_copy["poutcome"].value_counts()

nonexistent    3519
failure         454
success         142
5191              1
1.4               1
-1.8              1
93.918            1
Name: poutcome, dtype: int64

In [60]:
data_copy[['poutcome']][data_copy['poutcome'] == '5191']

    poutcome
678     5191

In [61]:
data_copy[['poutcome']][data_copy['poutcome'] == '1.4']

    poutcome
569      1.4

In [62]:
data_copy[['poutcome']][data_copy['poutcome'] == '-1.8']

    poutcome
650     -1.8

In [63]:
data_copy[['poutcome']][data_copy['poutcome'] == '93.918']

    poutcome
574   93.918

In [64]:
data_copy.loc[data_copy.poutcome == '5191','poutcome'] = np.nan
data_copy.loc[data_copy.poutcome == '1.4','poutcome'] = np.nan
data_copy.loc[data_copy.poutcome == '-1.8','poutcome'] = np.nan
data_copy.loc[data_copy.poutcome == '93.918','poutcome'] = np.nan

In [65]:
data_copy["emp_var_rate"].value_counts()

1.4       1624
-1.8       882
1.1        757
-0.1       392
-2.9       164
-3.4       104
-1.7        87
-1.1        83
-3          21
-0.2         1
92.893       1
no           1
-42.7        1
93.444       1
Name: emp_var_rate, dtype: int64

In [66]:
data_copy[['emp_var_rate']][data_copy['emp_var_rate'] == '92.893']

    emp_var_rate
650       92.893

In [67]:
data_copy[['emp_var_rate']][data_copy['emp_var_rate'] == 'no']

    emp_var_rate
678           no

In [68]:
data_copy[['emp_var_rate']][data_copy['emp_var_rate'] == '-42.7']

    emp_var_rate
574        -42.7

In [69]:
data_copy[['emp_var_rate']][data_copy['emp_var_rate'] == '93.444']

    emp_var_rate
569       93.444

In [70]:
data_copy.loc[data_copy.emp_var_rate == '92.893','emp_var_rate'] = np.nan
data_copy.loc[data_copy.emp_var_rate == 'no','emp_var_rate'] = np.nan
data_copy.loc[data_copy.emp_var_rate == '-42.7','emp_var_rate'] = np.nan
data_copy.loc[data_copy.emp_var_rate == '93.444','emp_var_rate'] = np.nan

In [71]:
data_copy["cons_price_idx"].value_counts()

 93.994    755
 93.918    665
 92.893    596
 93.444    527
 94.465    431
 93.200    386
 93.075    201
 92.201     75
 92.963     75
 92.431     43
 94.199     39
 92.649     36
 94.027     33
 94.215     30
 92.379     25
 92.843     25
 94.767     24
 94.055     24
 93.876     23
 93.369     23
 92.713     21
 94.601     20
 93.749     14
 92.469     14
 93.798      6
-46.200      1
-36.100      1
 4.962       1
 92.756      1
Name: cons_price_idx, dtype: int64

In [72]:
data_copy[['cons_price_idx']][data_copy['cons_price_idx'] == -46.200]

     cons_price_idx
650           -46.2

In [73]:
data_copy[['cons_price_idx']][data_copy['cons_price_idx'] == -36.100]

     cons_price_idx
569           -36.1

In [74]:
data_copy[['cons_price_idx']][data_copy['cons_price_idx'] == -4.962]

Empty DataFrame
Columns: [cons_price_idx]
Index: []

In [75]:
data_copy.loc[data_copy.cons_price_idx == -46.200, 'cons_price_idx'] = np.nan
data_copy.loc[data_copy.cons_price_idx == -36.100, 'cons_price_idx'] = np.nan
data_copy.loc[data_copy.cons_price_idx == -4.962, 'cons_price_idx'] = np.nan

In [76]:
data_copy["cons_conf_idx"].value_counts()

-36.400      757
-42.700      666
-46.200      596
-36.100      527
-41.800      431
-42.000      386
-47.100      201
-31.400       75
-40.800       75
-26.900       43
-37.500       39
-30.100       36
-38.300       33
-40.300       30
-29.800       25
-50.000       25
-50.800       24
-39.800       24
-34.800       23
-40.000       23
-33.000       21
-49.500       20
-34.600       14
-33.600       14
-40.400        6
 5228.100      1
 1.327         1
 4.963         1
-45.900        1
Name: cons_conf_idx, dtype: int64

In [77]:
data_copy[['cons_conf_idx']][data_copy['cons_conf_idx'] == 5228.100]

     cons_conf_idx
574         5228.1

In [78]:
data_copy[['cons_conf_idx']][data_copy['cons_conf_idx'] == 1.327]

     cons_conf_idx
650          1.327

In [79]:
data_copy[['cons_conf_idx']][data_copy['cons_conf_idx'] == 4.963]

     cons_conf_idx
569          4.963

In [80]:
data_copy.loc[data_copy.cons_conf_idx == 5228.100, 'cons_conf_idx'] = np.nan
data_copy.loc[data_copy.cons_conf_idx == 1.327, 'cons_conf_idx'] = np.nan
data_copy.loc[data_copy.cons_conf_idx == 4.963, 'cons_conf_idx'] = np.nan

In [81]:
data_copy["euribor3m"].value_counts()

4.857     274
4.963     255
4.962     236
4.961     212
4.856     138
4.965     114
4.964     110
1.405     106
4.96      105
4.968     101
4.076     100
4.864      97
4.12       82
4.855      81
4.86       80
4.859      76
4.959      76
4.191      73
4.966      72
1.266      71
1.281      68
4.858      66
4.958      66
4.153      64
4.967      62
4.021      61
1.299      59
1.327      58
1.334      58
1.25       54
         ...
1.059       1
1.028       1
0.921       1
0.885       1
1.224       1
0.889       1
1.4         1
1.531       1
0.937       1
0.987       1
0.829       1
0.778       1
0.782       1
5228.1      1
3.329       1
0.724       1
0.752       1
5.045       1
0.707       1
1.538       1
1.032       1
1.046       1
1.031       1
4.592       1
4.921       1
0.721       1
1.043       1
1.52        1
1.044       1
0.672       1
Name: euribor3m, Length: 237, dtype: int64

In [82]:
data_copy[['euribor3m']][data_copy['euribor3m'] == '5228.1']

    euribor3m
569    5228.1

In [83]:
data_copy[['euribor3m']][data_copy['euribor3m'] == 'no']

    euribor3m
574        no

In [84]:
data_copy.loc[data_copy.euribor3m == '5228.1','euribor3m'] = np.nan
data_copy.loc[data_copy.euribor3m == 'no','euribor3m'] = np.nan

In [85]:
data_copy["nr_employed"].value_counts()

5228.1    1624
5099.1     821
5191       757
5195.8     392
5076.2     164
5017.5     104
4991.6      87
4963.6      83
5008.7      59
5023.5      21
no           2
5176.3       1
Name: nr_employed, dtype: int64

In [86]:
data_copy[['nr_employed']][data_copy['nr_employed'] == 'no']

    nr_employed
569          no
650          no

In [87]:
data_copy.loc[data_copy.nr_employed == 'no','nr_employed'] = np.nan

In [88]:
data_copy["y"].value_counts()

no     3664
yes     451
Name: y, dtype: int64

In [89]:
data_copy.isnull().sum()

age               5
job               0
marital           1
education         1
default           1
housing           1
loan              3
contact           3
month             3
day_of_week       3
duration          0
campaign          3
pdays             2
previous          4
poutcome          4
emp_var_rate      4
cons_price_idx    6
cons_conf_idx     4
euribor3m         5
nr_employed       6
y                 4
dtype: int64

In [90]:
#lower case the text
data_copy["job"].str.lower()
data_copy["marital"].str.lower()
data_copy["education"].str.lower()
data_copy["default"].str.lower()
data_copy["housing"].str.lower()
data_copy["loan"].str.lower()
data_copy["month"].str.lower()
data_copy["day_of_week"].str.lower()
data_copy["poutcome"].str.lower()
data_copy["y"].str.lower()

0        no
1        no
2        no
3        no
4        no
5        no
6        no
7        no
8        no
9        no
10       no
11       no
12       no
13       no
14       no
15       no
16       no
17       no
18       no
19      yes
20       no
21      yes
22       no
23       no
24       no
25      yes
26       no
27       no
28       no
29       no
       ...
4089    yes
4090     no
4091     no
4092     no
4093     no
4094     no
4095     no
4096     no
4097     no
4098     no
4099     no
4100     no
4101     no
4102     no
4103     no
4104     no
4105     no
4106     no
4107     no
4108     no
4109     no
4110     no
4111     no
4112     no
4113     no
4114     no
4115     no
4116     no
4117     no
4118     no
Name: y, Length: 4119, dtype: object

In [91]:
data_copy["job"].str.strip()
data_copy["marital"].str.strip()
data_copy["education"].str.strip()
data_copy["default"].str.strip()
data_copy["housing"].str.strip()
data_copy["loan"].str.strip()
data_copy["month"].str.strip()
data_copy["day_of_week"].str.strip()
data_copy["poutcome"].str.strip()
data_copy["y"].str.strip()

0        no
1        no
2        no
3        no
4        no
5        no
6        no
7        no
8        no
9        no
10       no
11       no
12       no
13       no
14       no
15       no
16       no
17       no
18       no
19      yes
20       no
21      yes
22       no
23       no
24       no
25      yes
26       no
27       no
28       no
29       no
       ...
4089    yes
4090     no
4091     no
4092     no
4093     no
4094     no
4095     no
4096     no
4097     no
4098     no
4099     no
4100     no
4101     no
4102     no
4103     no
4104     no
4105     no
4106     no
4107     no
4108     no
4109     no
4110     no
4111     no
4112     no
4113     no
4114     no
4115     no
4116     no
4117     no
4118     no
Name: y, Length: 4119, dtype: object

In [92]:
data_copy.dtypes

age               float64
job                object
marital            object
education          object
default            object
housing            object
loan               object
contact            object
month              object
day_of_week        object
duration          float64
campaign          float64
pdays              object
previous           object
poutcome           object
emp_var_rate       object
cons_price_idx    float64
cons_conf_idx     float64
euribor3m          object
nr_employed        object
y                  object
dtype: object

In [93]:
data_copy = pd.DataFrame(data_copy)
data_copy['pdays'] = pd.to_numeric(data_copy['pdays'])
data_copy['duration'] = pd.to_numeric(data_copy['duration'])
data_copy['campaign'] = pd.to_numeric(data_copy['campaign'])
data_copy['previous'] = pd.to_numeric(data_copy['previous'])
data_copy['emp_var_rate'] = pd.to_numeric(data_copy['emp_var_rate'])
data_copy['euribor3m'] = pd.to_numeric(data_copy['euribor3m'])
data_copy['nr_employed'] = pd.to_numeric(data_copy['nr_employed'])
data_copy['marital'] = data_copy['marital'].astype('category')
data_copy['education'] = data_copy['education'].astype('category')
data_copy['default'] = data_copy['default'].astype('category')
data_copy['housing'] = data_copy['housing'].astype('category')
data_copy['loan'] = data_copy['loan'].astype('category')
data_copy['contact'] = data_copy['contact'].astype('category')
data_copy['month'] = data_copy['month'].astype('category')
data_copy['day_of_week'] = data_copy['day_of_week'].astype('category')
data_copy['poutcome'] = data_copy['poutcome'].astype('category')
data_copy['y'] = data_copy['y'].astype('category')
data_copy['job'] = data_copy['job'].astype('category')

In [94]:
data_copy["age"].mean()
data_copy["duration"].mean()
data_copy["campaign"].mean()
data_copy["previous"].mean()
data_copy["emp_var_rate"].mean()
data_copy["cons_price_idx"].mean()
data_copy["cons_conf_idx"].mean()
data_copy["euribor3m"].mean()
data_copy["nr_employed"].mean()

5166.516897641625

In [95]:
#replace NaN with mean
data_mean = data_copy.copy()

In [96]:
data_mean['age'].fillna(data_mean['age'].mean(axis=0), inplace = True)
data_mean['pdays'].fillna(data_mean['pdays'].mean(axis=0), inplace = True)
data_mean['previous'].fillna(data_mean['previous'].mean(axis=0), inplace = True)
data_mean['emp_var_rate'].fillna(data_mean['emp_var_rate'].mean(axis=0), inplace = True)
data_mean['cons_price_idx'].fillna(data_mean['cons_price_idx'].mean(axis=0), inplace = True)
data_mean['cons_conf_idx'].fillna(data_mean['cons_conf_idx'].mean(axis=0), inplace = True)
data_mean['euribor3m'].fillna(data_mean['euribor3m'].mean(axis=0), inplace = True)
data_mean['nr_employed'].fillna(data_mean['nr_employed'].mean(axis=0), inplace = True)

In [97]:
#replace with median
data_median = data_copy.copy()

In [98]:
data_median['age'].fillna(data_median['age'].median(axis=0), inplace = True)
data_median['pdays'].fillna(data_median['pdays'].median(axis=0), inplace = True)
data_median['previous'].fillna(data_median['previous'].median(axis=0), inplace = True)
data_median['emp_var_rate'].fillna(data_median['emp_var_rate'].median(axis=0), inplace = True)
data_median['cons_price_idx'].fillna(data_median['cons_price_idx'].median(axis=0), inplace = True)
data_median['cons_conf_idx'].fillna(data_median['cons_conf_idx'].median(axis=0), inplace = True)
data_median['euribor3m'].fillna(data_median['euribor3m'].median(axis=0), inplace = True)
data_median['nr_employed'].fillna(data_median['nr_employed'].median(axis=0), inplace = True)

In [99]:
#replace it with fix values
data_fix = data_copy.copy()

In [100]:
data_fix['age'].fillna(data_fix['age'].fillna(9999), inplace = True)
data_fix['pdays'].fillna(data_fix['pdays'].fillna(9999), inplace = True)
data_fix['previous'].fillna(data_fix['previous'].fillna(9999), inplace = True)
data_fix['emp_var_rate'].fillna(data_fix['emp_var_rate'].fillna(9999), inplace = True)
data_fix['cons_price_idx'].fillna(data_fix['cons_price_idx'].fillna(9999), inplace = True)
data_fix['cons_conf_idx'].fillna(data_fix['cons_conf_idx'].fillna(9999), inplace = True)
data_fix['euribor3m'].fillna(data_fix['euribor3m'].fillna(9999), inplace = True)
data_fix['nr_employed'].fillna(data_fix['nr_employed'].fillna(9999), inplace = True)

In [101]:
data_fix[['age']][data_fix.age == 9999]

        age
36   9999.0
385  9999.0
394  9999.0
433  9999.0
538  9999.0

In [102]:
data_fix[['pdays']][data_fix.pdays == 9999]

      pdays
574  9999.0
678  9999.0

In [103]:
data_fix[['previous']][data_fix.previous == 9999]

     previous
569    9999.0
574    9999.0
650    9999.0
678    9999.0

In [104]:
data_fix[['emp_var_rate']][data_fix.emp_var_rate == 9999]

     emp_var_rate
569        9999.0
574        9999.0
650        9999.0
678        9999.0

In [105]:
data_fix[['cons_price_idx']][data_fix.cons_price_idx == 9999]

     cons_price_idx
77           9999.0
249          9999.0
303          9999.0
569          9999.0
650          9999.0
678          9999.0

In [106]:
data_fix[['cons_conf_idx']][data_fix.cons_conf_idx == 9999]

     cons_conf_idx
569         9999.0
574         9999.0
650         9999.0
678         9999.0

In [107]:
data_fix[['euribor3m']][data_fix.euribor3m == 9999]

     euribor3m
44      9999.0
193     9999.0
569     9999.0
574     9999.0
678     9999.0

In [108]:
data_fix[['nr_employed']][data_fix.nr_employed == 9999]

     nr_employed
21        9999.0
30        9999.0
569       9999.0
574       9999.0
650       9999.0
678       9999.0

In [109]:
data_fix[['marital']][data_fix['marital'].isnull()]

    marital
650     NaN

In [110]:
data_fix[['education']][data_fix['education'].isnull()]

    education
574       NaN

In [111]:
data_fix[['default']][data_fix['default'].isnull()]

    default
569     NaN

In [112]:
data_fix[['housing']][data_fix['housing'].isnull()]

    housing
574     NaN

In [113]:
data_fix[['loan']][data_fix['loan'].isnull()]

    loan
569  NaN
574  NaN
650  NaN

In [114]:
data_fix[['month']][data_fix['month'].isnull()]

    month
569   NaN
574   NaN
650   NaN

In [115]:
data_fix[['day_of_week']][data_fix['day_of_week'].isnull()]

    day_of_week
569         NaN
574         NaN
650         NaN

In [116]:
data_fix[['poutcome']][data_fix['poutcome'].isnull()]

    poutcome
569      NaN
574      NaN
650      NaN
678      NaN

In [117]:
data_fix[['y']][data_fix['y'].isnull()]

       y
569  NaN
574  NaN
650  NaN
678  NaN

In [118]:
#remove all NaN
data_non_nan = data_copy.copy()

In [119]:
data1 = data_non_nan.dropna() 
data1.shape

(4103, 21)

In [120]:
#preparation for task 2
data1.to_csv('bank1.csv', sep=';', encoding='utf-8')